{
    "version": "https://jsonfeed.org/version/1",
    "title": "Roberto L. Delgado",
    "home_page_url": "http://localhost:4000/",
    "feed_url": "http://localhost:4000/feed.json",
    "description": "Full Stack Web Developer",
    "icon": "http://localhost:4000/apple-touch-icon.png",
    "favicon": "http://localhost:4000/favicon.ico",
    "expired": false,
    
    "author": "{"twitter"=>"roskideluge", "name"=>nil, "avatar"=>nil, "email"=>nil, "url"=>nil}",
    
"items": [
    
        {
            "id": "http://localhost:4000/2021/03/11/names.html",
            "title": "Names",
            "summary": "As I was finishing up grad school and looking for ways to satisfy the culminative requirement for my degree, I attempted to answer two research questions on the \"digital divide\" by exploring a concept I called \"ambient advertising.\" Don't ask me to clarify what I mean by this because I haven't the faintest idea. But what I remember about this experience, after the committee quickly rejected my feeble attempt at an answer, is the power of naming.",
            "content_text": "As I was finishing up grad school and looking for ways to satisfy the culminative requirement for my degree, I attempted to answer two research questions on the “digital divide” by exploring a concept I called “ambient advertising.” Don’t ask me to clarify what I mean by this because I haven’t the faintest idea. But what I remember about this experience, after the committee quickly rejected my feeble attempt at an answer, is the power of naming.What the committee should have said upon rejecting my work was that I was attempting to name a phenomenon prematurely, without establishing any sort of track record in the academic literature. They should also have said that I needed to design and implement a relevant quantitative or qualitative study of the media, which are the two main avenues of research in mass communications, and gather results that would lend support to my suggestion that such a thing as I was naming actually exists.Alas, I was too much of a poet (or dilettante) to abide by these implicit rules on naming in the academy. I did eventually find a different way to graduate, but this, I think, was the formative experience of grad school for me. By having my attempt at naming rejected like this, I learned that the act of naming is powerfully correlated with experiential knowledge of the context within which naming occurs.Dan Abromov, the talented developer of Redux and now a key engineer on the React team, engaged in some naming himself during his fantastic, if short lived, JustJavascript email course. In his case, however, he brought years of experience with the Javascript namespace to bear on his act of naming. One of the first things he did was clarify what was meant by a value in his Javascript mental model. As he explains it: “In the beginning was the Value. What is a value? It’s hard to say. This is like asking what a number is in math, or what a point is in geometry. A value is a thing in the JavaScript universe.”It’s interesting to me that he’s not saying what a value is existentially in the JavaScript universe, but he’s intimating that values refer to things in the universe, so, in other words, a name describes a functional relation between things.One of the biggest gains I’ve made in my thinking over the past few years has been my (often times clumsy) attempts to relate my use of words and symbols to some functional activity. So a name doesn’t exist by itself, but only in relation to something else, perhaps even as the embodiment of something else. My friend the psychoanalyst calls this process “inscription” and it plays a very important role in helping people to metabolize their experience of trauma.As I type these words, my partner and I are anxiously awaiting the first pangs of labor pain that will announce the imminent birth of our second child. We’ve settled on a biblical name for him. Our family doesn’t practice Christianity, but even so, I felt it important to read the book of the bible that will be his namesake. It’s a paradox of life, as I see it, that in naming something or someone you are also naming yourself. My self definition after becoming a parent is very much tied up with the way that the little being I help to name is now helping me name my experience. And I’m grateful, because a name for me, when the rubber meets to road, is just a way to describe the process of sinking my roots deeper in the earth.Reading:Kalanithi, Paul. When Breath Becomes Air. Random House, 2016.",
            "content_html": "<p>As I was finishing up grad school and looking for ways to satisfy the culminative requirement for my degree, I attempted to answer two research questions on the “digital divide” by exploring a concept I called “ambient advertising.” Don’t ask me to clarify what I mean by this because I haven’t the faintest idea. But what I remember about this experience, after the committee quickly rejected my feeble attempt at an answer, is the power of naming.</p><p>What the committee should have said upon rejecting my work was that I was attempting to name a phenomenon prematurely, without establishing any sort of track record in the academic literature. They should also have said that I needed to design and implement a relevant quantitative or qualitative study of the media, which are the two main avenues of research in mass communications, and gather results that would lend support to my <em>suggestion</em> that such a thing as I was naming actually exists.</p><p>Alas, I was too much of a poet (or dilettante) to abide by these implicit rules on naming in the academy. I did eventually find a different way to graduate, but this, I think, was the formative experience of grad school for me. By having my attempt at naming rejected like this, I learned that the act of naming is powerfully correlated with experiential knowledge of the context within which naming occurs.</p><p>Dan Abromov, the talented developer of Redux and now a key engineer on the React team, engaged in some naming himself during his fantastic, if short lived, <em>JustJavascript</em> email course. In his case, however, he brought years of experience with the Javascript namespace to bear on his act of naming. One of the first things he did was clarify what was meant by a <em>value</em> in his Javascript mental model. As he explains it: “<em>In the beginning was the Value</em>. What <em>is</em> a value? It’s hard to say. This is like asking what a number is in math, or what a point is in geometry. <strong>A value is a <em>thing</em> in the JavaScript universe.</strong>”</p><p>It’s interesting to me that he’s not saying what a value is existentially in the JavaScript universe, but he’s intimating that values refer to things in the universe, so, in other words, a name describes a functional relation between things.</p><p>One of the biggest gains I’ve made in my thinking over the past few years has been my (often times clumsy) attempts to relate my use of words and symbols to some functional activity. So a name doesn’t exist by itself, but only in relation to something else, perhaps even as the embodiment of something else. My friend the psychoanalyst calls this process “inscription” and it plays a very important role in helping people to metabolize their experience of trauma.</p><p>As I type these words, my partner and I are anxiously awaiting the first pangs of labor pain that will announce the imminent birth of our second child. We’ve settled on a biblical name for him. Our family doesn’t practice Christianity, but even so, I felt it important to read the book of the bible that will be his namesake. It’s a paradox of life, as I see it, that in naming something or someone you are also naming yourself. My self definition after becoming a parent is very much tied up with the way that the little being I help to name is now helping me name my experience. And I’m grateful, because a name for me, when the rubber meets to road, is just a way to describe the process of sinking my roots deeper in the earth.</p><p>Reading:<br />Kalanithi, Paul. <em>When Breath Becomes Air</em>. Random House, 2016.</p>",
            "url": "http://localhost:4000/2021/03/11/names.html",
            
            
            
            
            
            "date_published": "2021-03-11T00:00:00-10:00",
            "date_modified": "2021-03-11T00:00:00-10:00",
            
                "author": 
                "{"twitter"=>"roskideluge", "name"=>nil, "avatar"=>nil, "email"=>nil, "url"=>nil}"
                
            
        },
    
        {
            "id": "http://localhost:4000/2021/02/18/irvine.html",
            "title": "Irvine",
            "summary": "In _Palm Springs_ Roy asks Nyles, when the later is in a particularly despondent mood inside the infinte loop, \"where's your Irvine?\"",
            "content_text": "In Palm Springs Roy asks Nyles, when the later is in a particularly despondent mood inside the infinte loop, “where’s your Irvine?”For Roy his Irvine is actually in Irvine, CA. It’s the place where Nyles comes to in desperation after losing Sarah, who he accidentally coaxed into the infinte loop after a night of reckless seduction.Roy, who was similarly coaxed, is Nyles’s nemesis turned confidant. In this moment, sitting in Roy’s perfectly manicured back yard, grilling for his kids and drinking beers, he accepts Nyles as a son, in a way. After expressing his cycles of grief toward Nyles through various murderous permutations, Roy has arrived at a place where he can impart some wisdom to Nyles. I would even say that they’ve arrived at a place of love after unleashing on each other the most sadistic versions of themselves and letting those extinguish from an infinitely extended time horizon.In essence, Roy is saying to Nyles that he needs to find his home. He also needs to keep watch for a long time and keep returning to that place where his discomfort can sublimate into something more wholesome over time.Lately I’ve been using the idea of being close to home as a shorthand for being more centered, being more present in my day to day. Of course, I haven’t had to go through thousands or millions of iterations to find my Irvine, but the forced isolation of our pandemic has aided in the discovery.Reading: Wilson, Robert A. Prometheus Rising. Hilaritas Press, 2016.",
            "content_html": "<p>In <em>Palm Springs</em> Roy asks Nyles, when the later is in a particularly despondent mood inside the infinte loop, “where’s your Irvine?”</p><p>For Roy his Irvine is actually in Irvine, CA. It’s the place where Nyles comes to in desperation after losing Sarah, who he accidentally coaxed into the infinte loop after a night of reckless seduction.</p><p>Roy, who was similarly coaxed, is Nyles’s nemesis turned confidant. In this moment, sitting in Roy’s perfectly manicured back yard, grilling for his kids and drinking beers, he accepts Nyles as a son, in a way. After expressing his cycles of grief toward Nyles through various murderous permutations, Roy has arrived at a place where he can impart some wisdom to Nyles. I would even say that they’ve arrived at a place of love after unleashing on each other the most sadistic versions of themselves and letting those extinguish from an infinitely extended time horizon.</p><p>In essence, Roy is saying to Nyles that he needs to find his home. He also needs to keep watch for a long time and keep returning to that place where his discomfort can sublimate into something more wholesome over time.</p><p>Lately I’ve been using the idea of being close to home as a shorthand for being more centered, being more present in my day to day. Of course, I haven’t had to go through thousands or millions of iterations to find my Irvine, but the forced isolation of our pandemic has aided in the discovery.</p><p>Reading: <br />Wilson, Robert A. <em>Prometheus Rising</em>. Hilaritas Press, 2016.</p>",
            "url": "http://localhost:4000/2021/02/18/irvine.html",
            
            
            
            
            
            "date_published": "2021-02-18T00:00:00-10:00",
            "date_modified": "2021-02-18T00:00:00-10:00",
            
                "author": 
                "{"twitter"=>"roskideluge", "name"=>nil, "avatar"=>nil, "email"=>nil, "url"=>nil}"
                
            
        },
    
        {
            "id": "http://localhost:4000/2021/01/25/loops.html",
            "title": "Loops",
            "summary": "In the movie Groundhog Day, Phil Conners's revelation isn't limited to one day, but grows as a result of him maintaining his state after each iteration of the loop. What's interesting to me is his reluctant acceptance of what the repetition represents. In essence, Conners is presented with a choice, either accept to live in this moment forever, or deny it and self destruct.",
            "content_text": "In the movie Groundhog Day, Phil Conners’s revelation isn’t limited to one day, but grows as a result of him maintaining his state after each iteration of the loop. What’s interesting to me is his reluctant acceptance of what the repetition represents. In essence, Conners is presented with a choice, either accept to live in this moment forever, or deny it and self destruct.Given how much emphasis our culture places on overcomming obstacles by sheer grit and determination, it’s no surprise that, for some, the obvious moral lesson is to not get stuck in mental loops and that how we choose to view the obstacles in our lives is an essential part in how we overcome them.The problem for me isn’t that getting stuck in a loop is a depressing thought. That’s the conventional way to think about loops. What I’m curious about is not what my perception tells me about the loop, but what the scale of the loop tells me about why I’m stuck. As anyone who writes code knows, there’s a moment when you run the program and the console goes haywire. Somewhere in the code is a bug that’s producing an infinite loop.In my view, Nietzsche’s famous Gay Science 341 passage describes such an infinite loop. In this passage the reader is asked to imagine a demon introducing the hearer to a colossal moment where he is told that his life will repeat in all its details including the moment when the demon is speaking. Very few people have noticed the true scale of this moment. But as Paul Loeb explains, “Nietzsche’s implicit ethical recommendation is that I must change my life so that I am better disposed to myself and to life––so well disposed, in fact, that I long for the eternal repetition of its every detail” (444).In Phil Connor’s case, the scale of the loop itself and his progressive, hard won, acceptance of it is what’s making him stronger. The transformation begins when he realizes he can build a different self upon an infinite loop.So the question I’m holding is, what do we gain or lose by reimagining the scale of the loops in our lives?Reading: Loeb, Paul S. “The Colossal Moment in Nietzsche’s Gay Science 341” The Nietzschean Mind, edited by Paul Katsafanas, Routledge, 2017, pp. 428-447.",
            "content_html": "<p>In the movie <em>Groundhog Day</em>, Phil Conners’s revelation isn’t limited to one day, but grows as a result of him maintaining his state after each iteration of the loop. What’s interesting to me is his reluctant acceptance of what the repetition represents. In essence, Conners is presented with a choice, either accept to live in this moment forever, or deny it and self destruct.</p><p>Given how much emphasis our culture places on overcomming obstacles by sheer grit and determination, it’s no surprise that, for some, <a href=\"https://www.happyscribe.com/public/hidden-brain/minimizing-pain-maximizing-joy#paragraph_423?utm_source=public_transcript&amp;utm_medium=paragraph&amp;utm_campaign=public_promo\" target=\"_blank\">the obvious moral lesson is to not get stuck in mental loops and that how we choose to view the obstacles in our lives is an essential part in how we overcome them</a>.</p><p>The problem for me isn’t that getting stuck in a loop is a depressing thought. That’s the conventional way to think about loops. What I’m curious about is not what my perception tells me about the loop, but what the scale of the loop tells me about why I’m stuck. As anyone who writes code knows, there’s a moment when you run the program and the console goes haywire. Somewhere in the code is a bug that’s producing an infinite loop.</p><p>In my view, Nietzsche’s famous Gay Science 341 passage describes such an infinite loop. In this passage the reader is asked to imagine a demon introducing the hearer to a colossal moment where he is told that his life will repeat in all its details including the moment when the demon is speaking. Very few people have noticed the true scale of this moment. But as Paul Loeb explains, “Nietzsche’s implicit ethical recommendation is that I must change my life so that I am better disposed to myself and to life––so well disposed, in fact, that I long for the eternal repetition of its every detail” (444).</p><p>In Phil Connor’s case, the scale of the loop itself and his progressive, hard won, acceptance of it is what’s making him stronger. The transformation begins when he realizes he can build a different self upon an infinite loop.</p><p>So the question I’m holding is, what do we gain or lose by reimagining the scale of the loops in our lives?</p><p>Reading: <br />Loeb, Paul S. “<a href=\"https://www.academia.edu/34667598/The_Colossal_Moment_in_Nietzsches_Gay_Science_341\" target=\"_blank\">The Colossal Moment in Nietzsche’s Gay Science 341</a>” <em>The Nietzschean Mind</em>, edited by Paul Katsafanas, Routledge, 2017, pp. 428-447.</p>",
            "url": "http://localhost:4000/2021/01/25/loops.html",
            
            
            
            
            
            "date_published": "2021-01-25T00:00:00-10:00",
            "date_modified": "2021-01-25T00:00:00-10:00",
            
                "author": 
                "{"twitter"=>"roskideluge", "name"=>nil, "avatar"=>nil, "email"=>nil, "url"=>nil}"
                
            
        },
    
        {
            "id": "http://localhost:4000/2020/12/09/landscape.html",
            "title": "Landscape",
            "summary": "The gold rush era represented many things. One of its representations is a turbulent time when the fate of whole cultures was being decided and astronomical fortunes were being made.",
            "content_text": "The gold rush era represented many things. One of its representations is a turbulent time when the fate of whole cultures was being decided and astronomical fortunes were being made. Amid this turmoil, another revolution no less important was unfolding: the perfect representation of the land through photography. The lands of California were the first to be faithfully captured by the new technology.The American nation began to congeal through the ability of these landscape photographs to fix and provide a document for things that had only been imagined. The early landscape photographers had a dual mission, to develop the medium aesthetically and to make the land legible and thus conquerable. In other words, to turn land into landscapes.Gold rush era California was the perfect place for landscape photography because, above all, it afforded the nation with a vision of themselves as the first man, living out his manifest destiny by claiming and naming. Photography was the perfect handmaiden for this process of imaginative bootstrapping. The California photographers (hardy, resourceful, and technically astute) could make people see this vision (Solnit 2004).Fast forward to today and consider this group of landscape photographs of Puerto Rico. Here we see a vision of a place that has largesse, opulence and ritmo. There’s also technical homage to the tradition of using clouds as expressive elements in the compositions. But, arguably, what is best about these photographs is their joint cleansing effect realized through an invitation to really see this place again, but from a different vantage point. They testify to a desire to turn this landscape into land again, which, admittedly, may be quixotic, but here in Puerto Rico we know a thing or two about crazed Spaniards fighting against windmills.Reading: Rebecca Solnit, River of Shadows: Eadweard Muybridge and the Technological Wild WestPhoto: Jorge L. Delgado, Panoramas Isleños (book forthcoming)",
            "content_html": "<p><img src=\"/img/panoramas1.png\" alt=\"Jorge L. Delgado - Panoramas Isleños\" /></p><p>The gold rush era represented many things. One of its representations is a turbulent time when the fate of whole cultures was being decided and astronomical fortunes were being made. Amid this turmoil, another revolution no less important was unfolding: the perfect representation of the land through photography. The lands of California were the first to be faithfully captured by the new technology.</p><p>The American nation began to congeal through the ability of these landscape photographs to fix and provide a document for things that had only been imagined. The early landscape photographers had a dual mission, to develop the medium aesthetically and to make the land legible and thus conquerable. In other words, to turn land into landscapes.</p><p>Gold rush era California was the perfect place for landscape photography because, above all, it afforded the nation with a vision of themselves as the first man, living out his manifest destiny by claiming and naming. Photography was the perfect handmaiden for this process of imaginative bootstrapping. The California photographers (hardy, resourceful, and technically astute) could make people see this vision (Solnit 2004).</p><p>Fast forward to today and consider this group of landscape photographs of Puerto Rico. Here we see a vision of a place that has largesse, opulence and ritmo. There’s also technical homage to the tradition of using clouds as expressive elements in the compositions. But, arguably, what is best about these photographs is their joint cleansing effect realized through an invitation to really see this place again, but from a different vantage point. They testify to a desire to turn this landscape into land again, which, admittedly, may be quixotic, but here in Puerto Rico we know a thing or two about crazed Spaniards fighting against windmills.</p><p>Reading: <br />Rebecca Solnit, <a href=\"https://www.amazon.com/River-Shadows-Eadweard-Muybridge-Technological/dp/0142004103\">River of Shadows: Eadweard Muybridge and the Technological Wild West</a></p><p>Photo: <br />Jorge L. Delgado, <em>Panoramas Isleños</em> (book forthcoming)</p>",
            "url": "http://localhost:4000/2020/12/09/landscape.html",
            
            
            
            
            
            "date_published": "2020-12-09T00:00:00-10:00",
            "date_modified": "2020-12-09T00:00:00-10:00",
            
                "author": 
                "{"twitter"=>"roskideluge", "name"=>nil, "avatar"=>nil, "email"=>nil, "url"=>nil}"
                
            
        },
    
        {
            "id": "http://localhost:4000/2020/11/01/unfucked-minds.html",
            "title": "Why should our minds be unfucked?*",
            "summary": "I started dipping my toe into quantum mechanics. Specifically the Everett, \"many worlds\" interpretation. To say that it's a mind fuck would be a vast understatement.",
            "content_text": "I started dipping my toe into quantum mechanics. Specifically the Everett, “many worlds” interpretation. To say that it’s a mind fuck would be a vast understatement. It is the most fundamental shake up of how I’ve viewed the world. Here’s my poor summary of it based on my reading of Sean Carroll’s excellent book.Quantum states evolve according to the wave function which obeys Schrödinger’s equation. The wave function is a series of amplitudes which specify the probability of measuring any particle’s position at a particular place. The problem is that what measuring means at this fine grained resolution is complicated. Briefly, when particles become entangled, there’s a cornucopia super explosive cluster mind fuck that happens. Whereas text book QM and other interpretations are forced to wrestle with “spooky action at a distance” or invent new hidden elements to explain what’s going on, “many worlds” doesn’t add anything to the wave function formalism. The consequence is that the superpositions of quantum states are real, in other words, particles always exist in many worlds. When the wave function branches, some states are weighted more than others, so some branches that the wave function projects forward have a higher probability of existing. The reality described by this theory looks and feels nothing like our everyday reality. We’re not bumping into versions of ourselves in different worlds when we’re having our morning coffee. But this reality is what follows if we keep the theory as minimal and free of our own bagage as possible. As Carroll says, “we don’t chose quantum mechanics, we only choose to face up to it.”*Hat tip to my friend Paul Loeb for the title.Reading:Sean Carroll, Something Deeply Hidden: Quantum Worlds and the Emergence of Spacetime",
            "content_html": "<p>I started dipping my toe into quantum mechanics. Specifically the Everett, “many worlds” interpretation. To say that it’s a mind fuck would be a vast understatement. It is the most fundamental shake up of how I’ve viewed the world. Here’s my poor summary of it based on my reading of Sean Carroll’s excellent book.</p><p>Quantum states evolve according to the wave function which obeys Schrödinger’s equation. The wave function is a series of amplitudes which specify the probability of measuring any particle’s position at a particular place. The problem is that what <em>measuring</em> means at this fine grained resolution is complicated. Briefly, when particles become entangled, there’s a cornucopia super explosive cluster mind fuck that happens. Whereas text book QM and other interpretations are forced to wrestle with “spooky action at a distance” or invent new hidden elements to explain what’s going on, “many worlds” doesn’t add anything to the wave function formalism. The consequence is that the superpositions of quantum states are real, in other words, particles always exist in many worlds. When the wave function branches, some states are weighted more than others, so some branches that the wave function projects forward have a higher probability of existing. The reality described by this theory looks and feels nothing like our everyday reality. We’re not bumping into versions of ourselves in different worlds when we’re having our morning coffee. But this reality is what follows if we keep the theory as minimal and free of our own bagage as possible. As Carroll says, “we don’t chose quantum mechanics, we only choose to face up to it.”</p><p>*Hat tip to my friend Paul Loeb for the title.</p><p>Reading:Sean Carroll, <a href=\"https://www.amazon.com/Something-Deeply-Hidden-Emergence-Spacetime/dp/1524743011\">Something Deeply Hidden: Quantum Worlds and the Emergence of Spacetime</a></p>",
            "url": "http://localhost:4000/2020/11/01/unfucked-minds.html",
            
            
            
            
            
            "date_published": "2020-11-01T00:00:00-10:00",
            "date_modified": "2020-11-01T00:00:00-10:00",
            
                "author": 
                "{"twitter"=>"roskideluge", "name"=>nil, "avatar"=>nil, "email"=>nil, "url"=>nil}"
                
            
        },
    
        {
            "id": "http://localhost:4000/2020/10/01/signal-noise.html",
            "title": "Signal and Noise",
            "summary": "One of the fascinating things about working in development is being able to trace the trajectory of what you're doing in a broader history.",
            "content_text": "“Shannon proposed an unsettling inversion. Ignore the physical channel and accept its limits: we can overcome noise by manipulating our messages. The answer to noise is not in how loudly we speak, but in how we say what we say.” - A Mind at Play: How Claude Shannon Invented the Information AgeOne of the fascinating things about working in development is being able to trace the trajectory of what you’re doing in a broader history. Coding itself is an activity as ancient as the cuneiform script on clay tablets written by the scribes of Mesopotamia and the Ancient Near East. I highly recommend a google search of these cuneiform tablets to anyone interested in symbols and communication.When I was learning communication theory in school, there was a lot of hand wringing over the initial, mathematical, model of communcation because of the so called “hypodermic needle” theory of communication effects that it implied. In this view, all that was needed to engineer social change was to spread media devices (i.e. television and radio) to unruly populations and you could implant or incept your ideology directly into their minds and affect their behavior. Of course, after the initial fervor of communication/cybernetic studies post WWII, other theories came along that were more sociological and attempted to bridge the gap between the machine centered transmission of intelligence and people focused communication of meaning.What I hadn’t realized until recently, is that some of us working in this space have had the priviledge of seeing a complete shift in the concerns of media. During my first semester of grad school in 2005, for instance, we received the news that the last telegram was sent and that the historic medium was being shutdown. Take that in for a moment. In 2005, when Myspace and Facebook were vyying for users, people were still sending telegrams.I think that what’s underappreciated today is what the information pioneers did to the noise vs. signal ratio. Since the time of Aristotle and, arguably, since we learned to communicate with words, humans have struggled to contain the noise that distorts the signals (messages) that we want to send. The brilliance of the information theorists, culminating in the formalization of this work in the theory of Claude Shannon, is the complete elimination of noise. This may seem like small potatoes today, but if you think about all the things that could and did affect the ability to send signals perfectly through space, you can start to appreciate the magnitude of this accomplishment.In order to prove that noise has been completely eliminated, we can perform a simple experiment. Simply open your twitter account, click on the plus sign, compose a tweet and send it. Have a friend read out to you what your tweet says and then ask your friend to confirm receipt of the message by @replying with their favorite emoji.Of course, saying that noise has been conquered, doesn’t mean that there can’t be misunderstandings or even errors. This will have to wait until we’re able to augment our brains with AI and perform error corrections on the fly so that not only the content of messages is perfect but also their intent.Reading:James Gleick, The Information: A History, A Theory, A Flood",
            "content_html": "<p><em>“Shannon proposed an unsettling inversion. Ignore the physical channel and accept its limits: we can overcome noise by manipulating our messages. The answer to noise is not in how loudly we speak, but in how we say what we say.”</em> - <a href=\"https://www.amazon.com/dp/B01M5IJN1P/ref=dp-kindle-redirect?_encoding=UTF8&amp;btkr=1\">A Mind at Play: How Claude Shannon Invented the Information Age</a></p><p>One of the fascinating things about working in development is being able to trace the trajectory of what you’re doing in a broader history. Coding itself is an activity as ancient as the cuneiform script on clay tablets written by the scribes of Mesopotamia and the Ancient Near East. I highly recommend a google search of these cuneiform tablets to anyone interested in symbols and communication.</p><p>When I was learning communication theory in school, there was a lot of hand wringing over the initial, mathematical, model of communcation because of the so called “hypodermic needle” theory of communication effects that it implied. In this view, all that was needed to engineer social change was to spread media devices (i.e. television and radio) to unruly populations and you could implant or incept your ideology directly into their minds and affect their behavior. Of course, after the initial fervor of communication/cybernetic studies post WWII, other theories came along that were more sociological and attempted to bridge the gap between the machine centered transmission of intelligence and people focused communication of meaning.</p><p>What I hadn’t realized until recently, is that some of us working in this space have had the priviledge of seeing a complete shift in the concerns of media. During my first semester of grad school in 2005, for instance, we received the news that the last telegram was sent and that the historic medium was being shutdown. Take that in for a moment. In 2005, when Myspace and Facebook were vyying for users, people were still sending telegrams.</p><p>I think that what’s underappreciated today is what the information pioneers did to the noise vs. signal ratio. Since the time of Aristotle and, arguably, since we learned to communicate with words, humans have struggled to contain the noise that distorts the signals (messages) that we want to send. The brilliance of the information theorists, culminating in the formalization of this work in the theory of Claude Shannon, is the complete elimination of noise. This may seem like small potatoes today, but if you think about all the things that could and did affect the ability to send signals perfectly through space, you can start to appreciate the magnitude of this accomplishment.</p><p>In order to prove that noise has been completely eliminated, we can perform a simple experiment. Simply open your twitter account, click on the plus sign, compose a tweet and send it. Have a friend read out to you what your tweet says and then ask your friend to confirm receipt of the message by @replying with their favorite emoji.</p><p>Of course, saying that noise has been conquered, doesn’t mean that there can’t be misunderstandings or even errors. This will have to wait until we’re able to augment our brains with AI and perform error corrections on the fly so that not only the content of messages is perfect but also their intent.</p><p>Reading:</p><p>James Gleick, <a href=\"https://www.amazon.com/Information-History-Theory-Flood/dp/1400096235#ace-g7448806443\">The Information: A History, A Theory, A Flood</a></p>",
            "url": "http://localhost:4000/2020/10/01/signal-noise.html",
            
            
            
            
            
            "date_published": "2020-10-01T00:00:00-10:00",
            "date_modified": "2020-10-01T00:00:00-10:00",
            
                "author": 
                "{"twitter"=>"roskideluge", "name"=>nil, "avatar"=>nil, "email"=>nil, "url"=>nil}"
                
            
        },
    
        {
            "id": "http://localhost:4000/2020/09/03/uxx.html",
            "title": "From UX to X",
            "summary": "Why should we care about the user's experience or our own for that matter?",
            "content_text": "UX (user experience) is a thriving discipline with invaluable strategies for building user centered apps. There are tons of awesome articles on tricks and tactics to craft great UX. But what is experience, if I may be so bold to ask? And why should we care about the user’s experience or our own for that matter?As everybody knows, some types of experience are obvious and others are easy to miss. A whole lot of things happen before we can get to the user part of experience, or that may actively prevent the user from emerging at all. For example, a site’s backend is slow in loading, preventing a potential visitor from accessing a landing page, or the site is not mobile responsive causing frustrated visitors to bounce before trying to squeeze the content to their viewport.I think poor UX is a function of poor X. Once the label user is put on experience, it’s as if experience is demoted to second class status. But as developers who hope to enter a person’s experience stream, our work needs to strike a balance between interrupting and merging into the person’s experiential state as unobtrusively as possible.Experience is the backdrop against which good UX is measured.Reading:Michael Morgan, Delivering Meaning to Your Stakeholders",
            "content_html": "<p>UX (user experience) is a thriving discipline with invaluable strategies for building user centered apps. There are tons of awesome articles on tricks and tactics to craft great UX. But what is experience, if I may be so bold to ask? And why should we care about the user’s experience or our own for that matter?</p><p>As everybody knows, some types of experience are obvious and others are easy to miss. A whole lot of things happen before we can get to the <em>user</em> part of experience, or that may actively prevent the <em>user</em> from emerging at all. For example, a site’s backend is slow in loading, preventing a potential visitor from accessing a landing page, or the site is not mobile responsive causing frustrated visitors to bounce before trying to squeeze the content to their viewport.</p><p>I think poor UX is a function of poor X. Once the label <em>user</em> is put on experience, it’s as if experience is demoted to second class status. But as developers who hope to enter a person’s experience stream, our work needs to strike a balance between interrupting and merging into the person’s experiential state as unobtrusively as possible.</p><p>Experience is the backdrop against which good UX is measured.</p><p>Reading:</p><p>Michael Morgan, <a href=\"https://www.uxmatters.com/mt/archives/2020/10/delivering-meaning-to-your-stakeholders.php\">Delivering Meaning to Your Stakeholders</a></p>",
            "url": "http://localhost:4000/2020/09/03/uxx.html",
            
            
            
            
            
            "date_published": "2020-09-03T00:00:00-10:00",
            "date_modified": "2020-09-03T00:00:00-10:00",
            
                "author": 
                "{"twitter"=>"roskideluge", "name"=>nil, "avatar"=>nil, "email"=>nil, "url"=>nil}"
                
            
        },
    
        {
            "id": "http://localhost:4000/2020/08/06/baked.html",
            "title": "Baked Fresh Daily",
            "summary": "How we can use the same words to say different things",
            "content_text": "The other day my partner and I were talking about deception. She’s a writer and is aware of how we can use the same words to say different things. Take, for instance, the Subway slogan “baked fresh daily.” My assumption was that the bread was baked earlier that day and is therefore as fresh as a few hours. But this is wrong. According to a friend of her’s that worked in Subway, they don’t use the bread that is baked fresh to make sandwiches. Now it is strictly true that the bread is baked fresh everyday, but you are not eating that bread, you are actually eating the bread that was baked fresh yesterday or the day before. This is an example of what Jonathan Webber referred to as a true assertion with a bullshit implicature that is characteristic of much advertising.Jonathan Webber on Deceiving With Words - Philosophy Bites - March 1, 2015",
            "content_html": "<p>The other day my partner and I were talking about deception. She’s a writer and is aware of how we can use the same words to say different things. Take, for instance, the Subway slogan “baked fresh daily.” My assumption was that the bread was baked earlier that day and is therefore as fresh as a few hours. But this is wrong. According to a friend of her’s that worked in Subway, they don’t use the bread that is baked fresh to make sandwiches. Now it is strictly true that the bread is baked fresh everyday, but you are not eating that bread, you are actually eating the bread that <em>was</em> baked fresh yesterday or the day before. This is an example of what Jonathan Webber referred to as a true assertion with a bullshit implicature that is characteristic of much advertising.</p><p><a href=\"https://philosophybites.com/2015/03/jonathan-webber-on-deceiving-with-words.html#:~:text=Lying%20is%20one%20way%20of,in%20conversation%20with%20Nigel%20Warburton.\">Jonathan Webber on Deceiving With Words - Philosophy Bites - March 1, 2015</a></p>",
            "url": "http://localhost:4000/2020/08/06/baked.html",
            
            
            
            
            
            "date_published": "2020-08-06T00:00:00-10:00",
            "date_modified": "2020-08-06T00:00:00-10:00",
            
                "author": 
                "{"twitter"=>"roskideluge", "name"=>nil, "avatar"=>nil, "email"=>nil, "url"=>nil}"
                
            
        },
    
        {
            "id": "http://localhost:4000/2020/07/16/confidence.html",
            "title": "Confidence",
            "summary": "One trait that I've noticed is common to the best devs is confidence",
            "content_text": "As a practicing dev, I’m constantly on the lookout for good webinars and tutorials by other devs. One trait that I’ve noticed is common to the best devs is confidence. But this is not your typical ted-talky blustery confidence, but a quieter one that shows up during moments that can induce a stage fright just as terrifying, I’m talking about debugging during a live webinar.Having felt the rush of adrenaline and outright hopelessness of debugging on a deadline, I can empathize somewhat with the particular feelings they may have in those moments. But more interesting for me is how they overcome those feelings and stick with a process that in almost all cases results in them finding the bug and fixing the problem.When I think about confidence, I usually imagine a person that is also calm and collected under fire and is able to execute without collapsing in frustration. But the part that I don’t see is the many moments where they’ve had to cycle through the range of emotions that bring them to the brink of quiting, but they somehow keep going. I like to imagine each of these moments as a flexing that helps to strenghthen the confidence muscle.",
            "content_html": "<p>As a practicing dev, I’m constantly on the lookout for good webinars and tutorials by other devs. One trait that I’ve noticed is common to the best devs is confidence. But this is not your typical ted-talky blustery confidence, but a quieter one that shows up during moments that can induce a stage fright just as terrifying, I’m talking about debugging during a live webinar.</p><p>Having felt the rush of adrenaline and outright hopelessness of debugging on a deadline, I can empathize somewhat with the particular feelings they may have in those moments. But more interesting for me is how they overcome those feelings and stick with a process that in almost all cases results in them finding the bug and fixing the problem.</p><p>When I think about confidence, I usually imagine a person that is also calm and collected under fire and is able to execute without collapsing in frustration. But the part that I don’t see is the many moments where they’ve had to cycle through the range of emotions that bring them to the brink of quiting, but they somehow keep going. I like to imagine each of these moments as a flexing that helps to strenghthen the confidence muscle.</p>",
            "url": "http://localhost:4000/2020/07/16/confidence.html",
            
            
            
            
            
            "date_published": "2020-07-16T00:00:00-10:00",
            "date_modified": "2020-07-16T00:00:00-10:00",
            
                "author": 
                "{"twitter"=>"roskideluge", "name"=>nil, "avatar"=>nil, "email"=>nil, "url"=>nil}"
                
            
        },
    
        {
            "id": "http://localhost:4000/2020/06/02/growth-marketing.html",
            "title": "Two Models of Growth Marketing (a summary)",
            "summary": "You need to master all of the above fits to have a successful company that grows.",
            "content_text": "Value/CostSource: Matt Horiuchi, Director User Acquisition at CalmThe key equation is:LTV/CAC (Lifetime Value/Customer Acquisition Costs) = A percentage that represents value over cost.** NOTE:  Without an LTV/CAC model we have no idea how much we can pay for a customer, and having the attribution in place tells us how much we’re paying per customer. **Lifetime Value of a customer is how much value(money) we can expect from a customer throughout his/her lifetime with us. (A caveat: this information is not available on day one. As we engage in customer discovery/development, we determine the value of our customers).Customer Acquisition Costs is how much it costs us to acquire a customer, which means that we have in place attributions to track that customer. (Same caveat as above: we fine tune our attribution as we engage in customer discovery/development).Link attributionMost of the attribution we’ll be doing will be link attribution. Any platform that sells digital ad space uses a link attribution system. How? By using a url which serves as a link to the landing page while also including customizable campaign specific attributes (utm source, etc).At a minimum when we start to market online (facebook/instagram), we should create different landing pages/lead forms per media source.Market-Product-Channel-Model fitSource: Rachel Hepworth, Head of Growth Marketing at SlackYou need to master all of the above fits to have a successful company that grows. Getting one of the fits wrong will create a domino affect that affects all the other fits.Market: who are you selling to? The size of the market determines how big your company can grow. Who are the people? What are the challenges? Do they know they have those challenges? Do they care about those challenges?Product: What you’re selling.Channel: Where are you selling the product? In other words, how are you getting it to the market?You can’t change the channel, you can only optimize your product to better fit the channel. - Brian BalfourModel: How much are you selling it for? Low cost/high volume model? Or high volume/low cost model? This will affect the channel you chose.If you have fit, then how do you grow?Growth is a funnel, not a stage. Traditionally, marketing stops at acquisition, whereas growth goes through the entire funnel.Funnel: Acquisition » Activation » Retention » Revenue » ReferralAcquisition: all about product-channel fit. Low cost/High volume: search ads; High cost/low volume: high touch sales.Activation: Shrinking time to value, or how to get people to the “aha” moment faster.Retention: Keep users coming back. If they’re not in the product, find ways outside of the product to bring them back in.Revenue: $Referral: Do the customers tell others about your product?Every step of the funnel is important, not just the top of the funnel.Important to prioritize projects by ROI. So if you’re at a startup with limited resources, you need to prioritize learning over everything.ROI = Impact * Cost * RiskImpact isn’t just moving the numbers, it’s also how much you’re going to learn. The earlier stage you’re in, the more important the learning is. What’s important here is how quickly can we re-orient ourselves from the mis-assumptions we’ve made onto the right path? What’s your hypothesis? How will you confirm or invalidate it?North Star MetricA north star metric is a metric that is indicative of the health and growth of your company that can’t be gamified and can’t be influenced by spammy growth tactics.The north star metric has to be found, measured, monitored and used to align the entire company around it.Question from a person in the audience with a SaaS project management tool for homeowners and contractors: How can I define my NSM with a product that has difficult to track retention because of the lag between using the product and paying for it?Are there a set of “kick the tire” activities that are highly correlated with becoming a paying customer of your product, before they’re actually paying for your product? This is found by doing a bunch of number crunching and regression analysis.References:E806: Rachel Hepworth, Slack Head of Growth Marketing: how startups can best “Go to Market and Grow” - This Week in StartupsE958: Matt Horiuchi, Director of User Acquisition at Calm, breaks down “Growth, Paid Marketing &amp; Attribution” - This Week in Startups",
            "content_html": "<h1 id=\"valuecost\">Value/Cost</h1><p><strong>Source: Matt Horiuchi, Director User Acquisition at Calm</strong></p><p>The key equation is:</p><p>LTV/CAC (Lifetime Value/Customer Acquisition Costs) = A percentage that represents value over cost.</p><p><em>** NOTE:  Without an LTV/CAC model we have no idea how much we can pay for a customer, and having the attribution in place tells us how much we’re paying per customer. **</em></p><p><strong>Lifetime Value</strong> of a customer is how much value(money) we can expect from a customer throughout his/her lifetime with us. (A caveat: this information is <strong><em>not</em></strong> available on day one. As we engage in customer discovery/development, we determine the value of our customers).</p><p><strong>Customer Acquisition Costs</strong> is how much it costs us to acquire a customer, which means that we have in place attributions to track that customer. (Same caveat as above: we fine tune our attribution as we engage in customer discovery/development).</p><h1 id=\"link-attribution\">Link attribution</h1><p>Most of the attribution we’ll be doing will be link attribution. Any platform that sells digital ad space uses a link attribution system. How? By using a url which serves as a link to the landing page while also including customizable campaign specific attributes (utm source, etc).</p><p>At a minimum when we start to market online (facebook/instagram), we should create different landing pages/lead forms per media source.</p><h1 id=\"market-product-channel-model-fit\">Market-Product-Channel-Model fit</h1><p><strong>Source: Rachel Hepworth, Head of Growth Marketing at Slack</strong></p><p>You need to master all of the above fits to have a successful company that grows. Getting one of the fits wrong will create a domino affect that affects all the other fits.</p><p><strong>Market</strong>: who are you selling to? The size of the market determines how big your company can grow. Who are the people? What are the challenges? Do they know they have those challenges? Do they care about those challenges?</p><p><strong>Product</strong>: What you’re selling.</p><p><strong>Channel</strong>: Where are you selling the product? In other words, how are you getting it to the market?</p><p>You can’t change the channel, you can only optimize your product to better fit the channel. - Brian Balfour</p><p><strong>Model</strong>: How much are you selling it for? Low cost/high volume model? Or high volume/low cost model? This will affect the channel you chose.</p><h1 id=\"if-you-have-fit-then-how-do-you-grow\">If you have fit, then how do you grow?</h1><p>Growth is a funnel, not a stage. Traditionally, marketing stops at acquisition, whereas growth goes through the entire funnel.</p><p>Funnel: Acquisition » Activation » Retention » Revenue » Referral</p><p>Acquisition: all about product-channel fit. Low cost/High volume: search ads; High cost/low volume: high touch sales.</p><p>Activation: Shrinking time to value, or how to get people to the “aha” moment faster.</p><p>Retention: Keep users coming back. If they’re not in the product, find ways outside of the product to bring them back in.</p><p>Revenue: $</p><p>Referral: Do the customers tell others about your product?</p><h2 id=\"every-step-of-the-funnel-is-important-not-just-the-top-of-the-funnel\">Every step of the funnel is important, not just the top of the funnel.</h2><p>Important to prioritize projects by ROI. So if you’re at a startup with limited resources, you need to prioritize learning over everything.</p><p>ROI = Impact * Cost * Risk</p><p>Impact isn’t just moving the numbers, it’s also how much you’re going to learn. The earlier stage you’re in, the more important the learning is. What’s important here is how quickly can we re-orient ourselves from the mis-assumptions we’ve made onto the right path? What’s your hypothesis? How will you confirm or invalidate it?</p><h1 id=\"north-star-metric\">North Star Metric</h1><p>A north star metric is a metric that is indicative of the health and growth of your company that can’t be gamified and can’t be influenced by spammy growth tactics.</p><p>The north star metric has to be found, measured, monitored and used to align the entire company around it.</p><p>Question from a person in the audience with a SaaS project management tool for homeowners and contractors: How can I define my NSM with a product that has difficult to track retention because of the lag between using the product and paying for it?</p><p>Are there a set of “kick the tire” activities that are highly correlated with becoming a paying customer of your product, before they’re actually paying for your product? This is found by doing a bunch of number crunching and regression analysis.</p><p>References:</p><p><a href=\"https://www.youtube.com/watch?v=gmO4jomGuXI\">E806: Rachel Hepworth, Slack Head of Growth Marketing: how startups can best “Go to Market and Grow” - This Week in Startups</a></p><p><a href=\"https://podcasts.apple.com/au/podcast/e958-matt-horiuchi-director-user-acquisition-at-calm/id315114957?i=1000445156448\">E958: Matt Horiuchi, Director of User Acquisition at Calm, breaks down “Growth, Paid Marketing &amp; Attribution” - This Week in Startups</a></p>",
            "url": "http://localhost:4000/2020/06/02/growth-marketing.html",
            
            
            
            
            
            "date_published": "2020-06-02T00:00:00-10:00",
            "date_modified": "2020-06-02T00:00:00-10:00",
            
                "author": 
                "{"twitter"=>"roskideluge", "name"=>nil, "avatar"=>nil, "email"=>nil, "url"=>nil}"
                
            
        },
    
        {
            "id": "http://localhost:4000/2020/05/26/focus-framework.html",
            "title": "FOCUS framework by Justin Wilcox (a summary)",
            "summary": "Product market fit means satisfying a market that satisfies you.",
            "content_text": "Two fundamental principles of the lean method are:1. Declare your victories.2. People don’t buy products, people buy solutions to problems.So how can we build a product/service that solves people’s problems? One way is to seek what lean practitioners call product-market fit.What is product-market fit?“Product market fit means satisfying a market that satisfies you.” — Justin WilcoxWhat satisfies you?All people live in an attraction/aversion loop. People are passionate about things they are attracted to and averse to the things that bring discomfort/pain.The passion that is usually attached to a product/service needs to be attached to the declared victories instead. Doing so allows the startup founders to remain uncommitted to a particular product and service if it brings them no closer to achieving their declared victories.How can we satisfy a market? By achieving product-market fit.Justin Wilcox developed five experiments to better achieve product-market fit. The five experiments are intended as tests to five assumptions.These are:1. There are people out there that are trying to solve this problem.Finding early adopters test:Who are the people that are trying to solve the problem that your solution is also trying to solve, and can you find them?Use customer interviews to determine how customers describe their problem (marketing copy) and where they go to find solutions (marketing channels).The customer’s descriptions of the problem will be used as the marketing copy and the places they go to seek the solution will be the marketing channels.2. I am able to reach those people and describe the problem in a way that makes them want to consider my solution.Offer test:Here you find out how prospects are engaging with your offer and how you need to iterate your marketing (copy and channels).3. People are willing to pay me for the solution.Currency test:People will pay you the money you need to achieve your declared victory, if you build this thing/service. Ways to test this is via landing page pre-sales or letters of intent.4. The solution actually does solve the problem in a way that satisfies the customer.Utility test:Providing value, that is, can you actually solve people’s problems? Then, you be the solution to the problem, for example by beginning with a manual solution (Minimum Viable Product). It’s easier to take feedback from your customers if your solution is manual rather than automated.5. The solution can be automated and scaled.Scaling test:Now is the time to build software and robots to replace you and automate. And also to reach out to the 2nd or 3rd marketing channels and 2nd or 3rd customer segments.My take-aways:Building the product is what comes last in this framework. Before any building takes place there are 5 assumptions that need to be validated using the 5 tests/experiments (or some variation) described above.EDIT: 3/24/20As I revisit these notes, I realize that Wilcox’s framework goes beyond a startup success recipe and reaches upstream to the state of mind of the creator. By declaring your victories upfront, the framework calls on the creator to attempt to make their ultimate assumptions explicit. The point here, as I understand it, is not to create a rigid goal that must be followed at all costs, but to kick start the heart of the venture with a value.References:Focus Framework WebsiteInterview with Justin Wilcox - Soundcloud",
            "content_html": "<p>Two fundamental principles of the lean method are:</p><p><code>1. Declare your victories.</code><br /><code>2. People don’t buy products, people buy solutions to problems.</code></p><p>So how can we build a product/service that solves people’s problems? One way is to seek what lean practitioners call product-market fit.</p><p>What is product-market fit?</p><h2 id=\"product-market-fit-means-satisfying-a-market-that-satisfies-you--justin-wilcox\">“Product market fit means satisfying a market that satisfies you.” — Justin Wilcox</h2><p>What satisfies you?</p><p>All people live in an attraction/aversion loop. People are passionate about things they are attracted to and averse to the things that bring discomfort/pain.</p><p>The passion that is usually attached to a product/service needs to be attached to the declared victories instead. Doing so allows the startup founders to remain uncommitted to a particular product and service if it brings them no closer to achieving their declared victories.</p><p>How can we satisfy a market? By achieving product-market fit.</p><p>Justin Wilcox developed five experiments to better achieve product-market fit. The five experiments are intended as tests to five assumptions.</p><p>These are:</p><p><code>1. There are people out there that are trying to solve this problem.</code></p><p>Finding early adopters test:</p><p>Who are the people that are trying to solve the problem that your solution is also trying to solve, and can you find them?</p><p>Use customer interviews to determine how customers describe their problem (marketing copy) and where they go to find solutions (marketing channels).</p><p>The customer’s descriptions of the problem will be used as the marketing copy and the places they go to seek the solution will be the marketing channels.</p><p><code>2. I am able to reach those people and describe the problem in a way that makes them want to consider my solution.</code></p><p>Offer test:</p><p>Here you find out how prospects are engaging with your offer and how you need to iterate your marketing (copy and channels).</p><p><code>3. People are willing to pay me for the solution.</code></p><p>Currency test:</p><p>People will pay you the money you need to achieve your declared victory, if you build this thing/service. Ways to test this is via landing page pre-sales or letters of intent.</p><p><code>4. The solution actually does solve the problem in a way that satisfies the customer.</code></p><p>Utility test:</p><p>Providing value, that is, can you actually solve people’s problems? Then, you be the solution to the problem, for example by beginning with a manual solution (Minimum Viable Product). It’s easier to take feedback from your customers if your solution is manual rather than automated.</p><p><code>5. The solution can be automated and scaled.</code></p><p>Scaling test:</p><p>Now is the time to build software and robots to replace you and automate. And also to reach out to the 2nd or 3rd marketing channels and 2nd or 3rd customer segments.</p><p>My take-aways:</p><p>Building the product is what comes last in this framework. Before any building takes place there are 5 assumptions that need to be validated using the 5 tests/experiments (or some variation) described above.</p><p>EDIT: 3/24/20<br />As I revisit these notes, I realize that Wilcox’s framework goes beyond a startup success recipe and reaches upstream to the state of mind of the creator. By declaring your victories upfront, the framework calls on the creator to attempt to make their ultimate assumptions explicit. The point here, as I understand it, is not to create a rigid goal that must be followed at all costs, but to kick start the heart of the venture with a value.</p><p>References:</p><p><a href=\"https://thefocusframework.com/\">Focus Framework Website</a></p><p><a href=\"https://soundcloud.com/lean-startup/the-5-experiments-you-need-to-find-product-market-fit\">Interview with Justin Wilcox - Soundcloud</a></p>",
            "url": "http://localhost:4000/2020/05/26/focus-framework.html",
            
            
            
            
            
            "date_published": "2020-05-26T00:00:00-10:00",
            "date_modified": "2020-05-26T00:00:00-10:00",
            
                "author": 
                "{"twitter"=>"roskideluge", "name"=>nil, "avatar"=>nil, "email"=>nil, "url"=>nil}"
                
            
        }
    
    ]
}